Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
     ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-public-velocity-proxy-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-public-velocity-proxy-data_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-minecraft-public-velocity-proxy-data-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-public-velocity-proxy-data/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-public-velocity-proxy-data_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-minecraft-public-velocity-proxy-data-volsync"
+       user_name   = "volsync-kube-lab-minecraft-public-velocity-proxy-data"
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-survival-world-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-survival-world-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-survival-world-data_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-minecraft-survival-world-data-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-survival-world-data/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-survival-world-data_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-minecraft-survival-world-data-volsync"
+       user_name   = "volsync-kube-lab-minecraft-survival-world-data"
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-velocity-proxy-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-velocity-proxy-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-velocity-proxy-data_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-minecraft-velocity-proxy-data-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/gaming/minecraft-velocity-proxy-data/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-minecraft-velocity-proxy-data_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-minecraft-velocity-proxy-data-volsync"
+       user_name   = "volsync-kube-lab-minecraft-velocity-proxy-data"
    }

  # module.bucket_policies["policy_volsync-kube-lab-n8n-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/n8n-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-n8n-data_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-n8n-data-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/home-automation/n8n-data/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-n8n-data_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-n8n-data-volsync"
+       user_name   = "volsync-kube-lab-n8n-data"
    }

  # module.bucket_policies["policy_volsync-kube-lab-node-red-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/node-red-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-node-red-data_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-node-red-data-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/home-automation/node-red-data/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-node-red-data_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-node-red-data-volsync"
+       user_name   = "volsync-kube-lab-node-red-data"
    }

  # module.bucket_policies["policy_volsync-kube-lab-nzbget-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/nzbget-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-nzbget-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-nzbget-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/media/nzbget-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-nzbget-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-nzbget-config-volsync"
+       user_name   = "volsync-kube-lab-nzbget-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab-plex-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/plex-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-plex-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-plex-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/media/plex-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-plex-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-plex-config-volsync"
+       user_name   = "volsync-kube-lab-plex-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab-prowlarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/prowlarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-prowlarr-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-prowlarr-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/media/prowlarr-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-prowlarr-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-prowlarr-config-volsync"
+       user_name   = "volsync-kube-lab-prowlarr-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab-radarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/radarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-radarr-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-radarr-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/media/radarr-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-radarr-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-radarr-config-volsync"
+       user_name   = "volsync-kube-lab-radarr-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab-recyclarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/recyclarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-recyclarr-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-recyclarr-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/media/recyclarr-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-recyclarr-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-recyclarr-config-volsync"
+       user_name   = "volsync-kube-lab-recyclarr-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab-ring-mqtt-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/ring-mqtt-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-ring-mqtt-data_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-ring-mqtt-data-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/home-automation/ring-mqtt-data/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-ring-mqtt-data_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-ring-mqtt-data-volsync"
+       user_name   = "volsync-kube-lab-ring-mqtt-data"
    }

  # module.bucket_policies["policy_volsync-kube-lab-sabnzbd-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/sabnzbd-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-sabnzbd-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-sabnzbd-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/media/sabnzbd-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-sabnzbd-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-sabnzbd-config-volsync"
+       user_name   = "volsync-kube-lab-sabnzbd-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab-seerr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/seerr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-seerr-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-seerr-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/media/seerr-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-seerr-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-seerr-config-volsync"
+       user_name   = "volsync-kube-lab-seerr-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab-sonarr-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/media/sonarr-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-sonarr-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-sonarr-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/media/sonarr-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-sonarr-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-sonarr-config-volsync"
+       user_name   = "volsync-kube-lab-sonarr-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab-syncthing-config_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/productivity/syncthing-config/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-syncthing-config_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-syncthing-config-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/productivity/syncthing-config/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-syncthing-config_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-syncthing-config-volsync"
+       user_name   = "volsync-kube-lab-syncthing-config"
    }

  # module.bucket_policies["policy_volsync-kube-lab-zigbee2mqtt-data_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/home-automation/zigbee2mqtt-data/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab-zigbee2mqtt-data_volsync"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "volsync-kube-lab-zigbee2mqtt-data-volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:DeleteObject",
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::volsync/kube-lab/home-automation/zigbee2mqtt-data/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_volsync-kube-lab-zigbee2mqtt-data_volsync"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "volsync-kube-lab-zigbee2mqtt-data-volsync"
+       user_name   = "volsync-kube-lab-zigbee2mqtt-data"
    }

  # module.bucket_policies["policy_volsync-kube-lab_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-nas_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/nas/*",
            ]
        }
    }

  # module.users["volsync-kube-lab-gatus-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-gatus-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-gatus-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-gatus-data"
    }

  # module.users["volsync-kube-lab-home-assistant-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-home-assistant-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-home-assistant-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-home-assistant-config"
    }

  # module.users["volsync-kube-lab-jellyfin-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-jellyfin-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-jellyfin-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-jellyfin-config"
    }

  # module.users["volsync-kube-lab-minecraft-creative-world-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-creative-world-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-creative-world-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-creative-world-data"
    }

  # module.users["volsync-kube-lab-minecraft-crowlex-lobby-world-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-crowlex-lobby-world-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-crowlex-lobby-world-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-crowlex-lobby-world-data"
    }

  # module.users["volsync-kube-lab-minecraft-lobby-world-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-lobby-world-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-lobby-world-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-lobby-world-data"
    }

  # module.users["volsync-kube-lab-minecraft-playground-world-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-playground-world-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-playground-world-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-playground-world-data"
    }

  # module.users["volsync-kube-lab-minecraft-public-lobby-world-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-public-lobby-world-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-public-lobby-world-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-public-lobby-world-data"
    }

  # module.users["volsync-kube-lab-minecraft-public-playground-world-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-public-playground-world-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-public-playground-world-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-public-playground-world-data"
    }

  # module.users["volsync-kube-lab-minecraft-public-pvp-world-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-public-pvp-world-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-public-pvp-world-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-public-pvp-world-data"
    }

  # module.users["volsync-kube-lab-minecraft-public-survival-world-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-public-survival-world-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-public-survival-world-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-public-survival-world-data"
    }

  # module.users["volsync-kube-lab-minecraft-public-velocity-proxy-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-public-velocity-proxy-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-public-velocity-proxy-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-public-velocity-proxy-data"
    }

  # module.users["volsync-kube-lab-minecraft-survival-world-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-survival-world-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-survival-world-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-survival-world-data"
    }

  # module.users["volsync-kube-lab-minecraft-velocity-proxy-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-minecraft-velocity-proxy-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-minecraft-velocity-proxy-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-minecraft-velocity-proxy-data"
    }

  # module.users["volsync-kube-lab-n8n-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-n8n-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-n8n-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-n8n-data"
    }

  # module.users["volsync-kube-lab-node-red-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-node-red-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-node-red-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-node-red-data"
    }

  # module.users["volsync-kube-lab-nzbget-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-nzbget-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-nzbget-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-nzbget-config"
    }

  # module.users["volsync-kube-lab-plex-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-plex-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-plex-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-plex-config"
    }

  # module.users["volsync-kube-lab-prowlarr-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-prowlarr-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-prowlarr-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-prowlarr-config"
    }

  # module.users["volsync-kube-lab-radarr-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-radarr-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-radarr-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-radarr-config"
    }

  # module.users["volsync-kube-lab-recyclarr-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-recyclarr-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-recyclarr-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-recyclarr-config"
    }

  # module.users["volsync-kube-lab-ring-mqtt-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-ring-mqtt-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-ring-mqtt-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-ring-mqtt-data"
    }

  # module.users["volsync-kube-lab-sabnzbd-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-sabnzbd-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-sabnzbd-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-sabnzbd-config"
    }

  # module.users["volsync-kube-lab-seerr-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-seerr-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-seerr-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-seerr-config"
    }

  # module.users["volsync-kube-lab-sonarr-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-sonarr-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-sonarr-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-sonarr-config"
    }

  # module.users["volsync-kube-lab-syncthing-config"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-syncthing-config"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-syncthing-config"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-syncthing-config"
    }

  # module.users["volsync-kube-lab-zigbee2mqtt-data"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "volsync-kube-lab-zigbee2mqtt-data"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["volsync-kube-lab-zigbee2mqtt-data"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/volsync-kube-lab-zigbee2mqtt-data"
    }

Plan: 108 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p nas.techtales.io
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-techtales-io-terraform-minio.techtales.io/lock?id=techtales-io%252Fterraform-minio%252Fterraform%252Fnas.techtales.io%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p nas.techtales.io
  ```
Plan: 108 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```